Website_Edukasi/app/Controllers/Kerajaan.php

    public function detail($id)
    {
        $kerajaanModel = new KerajaanModel();
        $peristiwaModel = new PeristiwaModel();

        // Ambil data kerajaan
        $data['kerajaan'] = $kerajaanModel->find($id);

        if (!$data['kerajaan']) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        // Ambil peristiwa yang terkait
        $data['peristiwa'] = $peristiwaModel
            ->where('kerajaan_id', $id)
            ->orderBy('tahun', 'ASC')
            ->findAll();
---
SELECT *
FROM `peristiwa`
WHERE `kerajaan_id` = '8'
ORDER BY `tahun` ASC