Website_Edukasi/app/Controllers/QuizController.php

SELECT *
FROM `mapel`
---
    public function index()
    {
        // Mengambil semua data kerajaan/mapel yang tersedia
        $kerajaan = $this->mapelModel->findAll();

SELECT `id`, `pertanyaan`, `pilihan_a`, `pilihan_b`, `pilihan_c`, `pilihan_d`, `jawaban_benar`
FROM `soal_quiz`
ORDER BY RAND()
 LIMIT 20
---
    public function start($mapelId = 'random')
    {
        $questions = [];
        $kerajaan = null;
        $title = "Kuis Umum Nusantara";
        $limit = 20; // Batasi jumlah soal per kuis menjadi 10 (bisa disesuaikan)

        // 1. Sanitasi input
        $mapelId = filter_var($mapelId, FILTER_SANITIZE_STRING);

        $queryBuilder = $this->quizModel
            ->select('id, pertanyaan, pilihan_a, pilihan_b, pilihan_c, pilihan_d, jawaban_benar');

        if ($mapelId === 'random') {
            // MODE: Kuis Acak dari seluruh database

            // PERBAIKAN: Mengganti orderBy('id', 'RANDOM') dengan orderBy(RAND())
            // Ini biasanya memaksa database untuk melakukan pengacakan yang lebih segar.
            $questions = $queryBuilder
                ->orderBy('RAND()')
                ->findAll($limit);

SELECT *
FROM `soal_quiz`
WHERE `soal_quiz`.`id` = 93
---
    public function submit()
    {
        $answers = $this->request->getPost('answers');

        if (empty($answers) || !is_array($answers)) {
            return redirect()->back()->with('error', 'Tidak ada jawaban yang dikirim! Silakan pilih jawaban sebelum menyelesaikan kuis.');
        }

        $score = 0;
        $total = count($answers);
        $results = [];
        $title = 'Hasil Kuis Anda';

        foreach ($answers as $id => $answer) {
            $question = $this->quizModel->find($id);