Website_Edukasi/app/Controllers/Admin/Dashboard.php

    public function index()
    {
        // ambil cookie dengan cara CI4 yang benar
        $tutor_id = $this->request->getCookie('tutor_id');

        if (!$tutor_id) {
            return redirect()->to('/login');
        }

        $tutors  = new TutorModel();
        $materi  = new MateriModel();
        $mapel   = new MapelModel();
        $raja    = new RajaModel();
        $peristiwa = new PeristiwaModel(); // Tambahkan ini
        $soal      = new SoalModel();      // Tambahkan ini

        $profile = $tutors->find($tutor_id);

        // Hitung total raja dari semua mapel milik tutor ini
        $totalRaja = 0;
        $mapels = $mapel->where('tutor_id', $tutor_id)->findAll();

        foreach ($mapels as $mapelItem) {
            $totalRaja += $raja->where('mapel_id', $mapelItem['id'])->countAllResults();
        }

        // Hitung total peristiwa dari semua mapel milik tutor ini
        $totalPeristiwa = 0;
        foreach ($mapels as $mapelItem) {
            $totalPeristiwa += $peristiwa->where('kerajaan_id', $mapelItem['id'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `peristiwa`
WHERE `kerajaan_id` = '5'