Website_Edukasi/app/Controllers/Admin/Dashboard.php

    public function index()
    {
        // ambil cookie dengan cara CI4 yang benar
        $tutor_id = $this->request->getCookie('tutor_id');

        if (!$tutor_id) {
            return redirect()->to('/login');
        }

        $tutors  = new TutorModel();
        $materi  = new MateriModel();
        $mapel   = new MapelModel();
        $comment = new CommentModel();

        $profile = $tutors->find($tutor_id);

        return view('admin/dashboard', [
            'profile'        => $profile,
            'total_contents' => $materi->where('tutor_id', $tutor_id)->countAllResults(),
            'total_mapel'    => $mapel->where('tutor_id', $tutor_id)->countAllResults(),
            'total_comments' => $comment->where('tutor_id', $tutor_id)->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `comments`
WHERE `tutor_id` = 'xiSTC60TXGui9PicT3x1'