Website_Edukasi/app/Controllers/Admin/Mapel.php

SELECT *
FROM `tutors`
WHERE `tutors`.`id` = 'MTk3EpvEUfQlXeCopxXK'
SELECT *
FROM `mapel`
WHERE `tutor_id` = 'MTk3EpvEUfQlXeCopxXK'
ORDER BY `date` DESC
SELECT *
FROM `mapel`
ORDER BY `date` DESC
---
public function index()
{
    $tutor_id = $this->request->getCookie('tutor_id');

    if (!$tutor_id) {
        return redirect()->to('/login');
    }

    $mapelModel = new MapelModel();
    $tutorModel = new TutorModel();

    $profile = $tutorModel->find($tutor_id);

    $data = [
        'profile' => $profile,
        'mapel'   => $mapelModel->orderBy('date', 'DESC')->findAll() // Hapus where()
    ];