Website_Edukasi/app/Controllers/Admin/Materi.php

SELECT *
FROM `content`
WHERE `tutor_id` = 'MTk3EpvEUfQlXeCopxXK'
ORDER BY `date` DESC
SELECT *
FROM `materi`
WHERE `tutor_id` = 'MTk3EpvEUfQlXeCopxXK'
ORDER BY `date` DESC
SELECT `soal`.*, `content`.`title` AS `video_title`
FROM `soal`
LEFT JOIN `content` ON `content`.`id` = `soal`.`content_id`
WHERE `soal`.`tutor_id` = 'MTk3EpvEUfQlXeCopxXK'
ORDER BY `soal`.`date` DESC
---
    public function index()
    {
        $tutor_id = $this->request->getCookie('tutor_id');

        if (!$tutor_id) {
            return redirect()->to('/login');
        }

        $tutorModel   = new TutorModel();
        $materiModel  = new MateriModel();
        $contentModel = new ContentModel();
        $soalModel    = new SoalModel();

        $profile = $tutorModel->find($tutor_id);

        $data = [
            'profile' => $profile,

            // LIST VIDEO
            'videos' => $contentModel->where('tutor_id', $tutor_id)
                                     ->orderBy('date', 'DESC')
                                     ->findAll(),

            // LIST MATERI
            'materi' => $materiModel->where('tutor_id', $tutor_id)
                                    ->orderBy('date', 'DESC')
                                    ->findAll(),

            // LIST SOAL + JOIN video title
            'soal' => $soalModel->select('soal.*, content.title AS video_title')
                                ->join('content', 'content.id = soal.content_id', 'left')
                                ->where('soal.tutor_id', $tutor_id)
                                ->orderBy('soal.date', 'DESC')
                                ->findAll(),