Website_Edukasi/app/Controllers/Admin/Materi.php

SELECT *
FROM `tutors`
WHERE `tutors`.`id` = 'MTk3EpvEUfQlXeCopxXK'
SELECT *
FROM `mapel`
WHERE `tutor_id` = 'MTk3EpvEUfQlXeCopxXK'
 LIMIT 1
SELECT *
FROM `raja`
ORDER BY `created_at` DESC
SELECT *
FROM `mapel`
---
public function index()
{
    $tutor_id = $this->request->getCookie('tutor_id');

    if (!$tutor_id) {
        return redirect()->to('/login');
    }

    $tutorModel   = new TutorModel();
    $materiModel  = new MateriModel();
    $contentModel = new ContentModel();
    $soalModel    = new SoalModel();
    $mapelModel   = new MapelModel();
    $rajaModel    = new RajaModel();
    $peristiwaModel = new PeristiwaModel(); // <-- TAMBAHKAN INI

    $profile = $tutorModel->find($tutor_id);

    // Ambil semua soal dari database
    $soal = $soalModel->findAll();

    // Ambil data mapel berdasarkan tutor_id - AMBIL YANG PERTAMA SAJA
    $mapel = $mapelModel->where('tutor_id', $tutor_id)->first();

    // AMBIL SEMUA DATA RAJA dengan nama kerajaan
    $allRaja = $rajaModel->orderBy('created_at', 'DESC')->findAll();
    $allMapel = $mapelModel->findAll();

SELECT *
FROM `peristiwa`
ORDER BY `tahun` ASC
---
    }

    // AMBIL SEMUA DATA PERISTIWA dengan nama kerajaan - TAMBAHKAN INI
    $allPeristiwa = $peristiwaModel->orderBy('tahun', 'ASC')->findAll();

SELECT *
FROM `content`
WHERE `tutor_id` = 'MTk3EpvEUfQlXeCopxXK'
ORDER BY `date` DESC
SELECT *
FROM `materi`
WHERE `tutor_id` = 'MTk3EpvEUfQlXeCopxXK'
ORDER BY `date` DESC
---

    $data = [
        'profile' => $profile,
        'videos' => $contentModel->where('tutor_id', $tutor_id)
                                 ->orderBy('date', 'DESC')
                                 ->findAll(),
        'materi' => $materiModel->where('tutor_id', $tutor_id)
                                ->orderBy('date', 'DESC')
                                ->findAll(),