Website_Edukasi/app/Controllers/Admin/Peristiwa.php

public function edit($id = null)
{
    $tutor_id = $this->request->getCookie('tutor_id');
    if (!$tutor_id) {
        return redirect()->to('/login');
    }

    // Inisialisasi model
    $tutorModel = new TutorModel();
    $peristiwaModel = new PeristiwaModel();
    $mapelModel = new MapelModel();

    // Ambil data
    $profile = $tutorModel->find($tutor_id);
    $peristiwa = $peristiwaModel->find($id);

    if (!$peristiwa) {
        return redirect()->back()->with('error', 'Peristiwa tidak ditemukan!');
    }

    // Cek kepemilikan
    $mapel = $mapelModel->where('id', $peristiwa['kerajaan_id'])
                       ->where('tutor_id', $tutor_id)
                       ->first();

    if (!$mapel) {
        return redirect()->to('/admin/mapel')->with('error', 'Akses ditolak!');
    }

    // Ambil semua kerajaan milik tutor
    $mapelList = $mapelModel->where('tutor_id', $tutor_id)->findAll();
---
SELECT *
FROM `tutors`
WHERE `tutors`.`id` = 'MTk3EpvEUfQlXeCopxXK'
SELECT *
FROM `peristiwa`
WHERE `peristiwa`.`id` = '74'
SELECT *
FROM `mapel`
WHERE `id` = '5'
AND `tutor_id` = 'MTk3EpvEUfQlXeCopxXK'
 LIMIT 1
SELECT *
FROM `mapel`
WHERE `tutor_id` = 'MTk3EpvEUfQlXeCopxXK'