Website_Edukasi/app/Controllers/Admin/Raja.php

    public function index($mapel_id = null)
    {
        // Cek login
        $tutor_id = $this->request->getCookie('tutor_id');
        if (!$tutor_id) {
            return redirect()->to('/login');
        }

        if (!$mapel_id) {
            return redirect()->to('/admin/mapel');
        }

        $mapelModel = new MapelModel();

        // Ambil data mapel
        $mapel = $mapelModel->where('id', $mapel_id)
                           ->where('tutor_id', $tutor_id)
                           ->first();

        if (!$mapel) {
            return redirect()->to('/admin/mapel')->with('error', 'Kerajaan tidak ditemukan!');
        }

        // Ambil daftar raja dengan Query Builder langsung
        $db = \Config\Database::connect();
        $raja = $db->table('raja')
                  ->where('mapel_id', $mapel_id)
                  ->orderBy('nama', 'ASC')
                  ->get()
                  ->getResultArray();
---
SELECT *
FROM `mapel`
WHERE `id` = 'CZsJx0RxxG4mdq3LT7TK'
AND `tutor_id` = 'MTk3EpvEUfQlXeCopxXK'
 LIMIT 1
SELECT *
FROM `raja`
WHERE `mapel_id` = 'CZsJx0RxxG4mdq3LT7TK'
ORDER BY `nama` ASC

    private function getProfile($tutor_id)
    {
        $db = \Config\Database::connect();
        return $db->table('tutors')->where('id', $tutor_id)->get()->getRowArray();
---
SELECT *
FROM `tutors`
WHERE `id` = 'MTk3EpvEUfQlXeCopxXK'