Website_Edukasi/app/Controllers/Admin/UpdateMateri.php

    public function index($id)
    {
        $tutor_id = $this->request->getCookie('tutor_id');
        if (!$tutor_id) {
            return redirect()->to('/login');
        }

        $materiModel = new MateriModel();
        $tutorModel  = new TutorModel();

        $profile = $tutorModel->find($tutor_id);

        $materi = $materiModel->where('id', $id)->first();
---
SELECT *
FROM `tutors`
WHERE `tutors`.`id` = 'BoA3Ocf6wlvdCggxCK1q'
SELECT *
FROM `materi`
WHERE `id` = '9'
 LIMIT 1