Website_Edukasi/app/Controllers/Admin/ViewMapel.php

SELECT *
FROM `mapel`
WHERE `mapel`.`id` = '5'
SELECT *
FROM `peristiwa`
WHERE `kerajaan_id` = '5'
---
    public function index($id)
    {
        $tutor_id = $this->request->getCookie('tutor_id');
        if (!$tutor_id) {
            return redirect()->to('/login');
        }

        $mapelModel     = new MapelModel();
        $peristiwaModel = new PeristiwaModel(); // Ganti ContentModel dengan PeristiwaModel
        $soalModel      = new SoalModel();
        $tutorModel     = new TutorModel();

        // ambil profil tutor
        $profile = $tutorModel->find($tutor_id);

        // Hapus filter tutor_id agar semua mapel bisa dilihat
        $mapel = $mapelModel->find($id);

        if (!$mapel) {
            return redirect()->back()->with('error', 'Kerajaan tidak ditemukan!');
        }

        // Ambil peristiwa berdasarkan kerajaan_id (ganti playlist_id dengan kerajaan_id)
        $peristiwa = $peristiwaModel->where('kerajaan_id', $id)->findAll();