Website_Edukasi/app/Controllers/Admin/ViewMateri.php

    public function index($id)
    {
        $tutor_id = $this->request->getCookie('tutor_id');

        if (!$tutor_id) {
            return redirect()->to('/login');
        }

        $materiModel = new MateriModel();
        $tutorModel  = new TutorModel();

        $profile = $tutorModel->find($tutor_id);

        // Ambil data materi sesuai ID dan tutor
        $materi = $materiModel
                    ->where('id', $id)
                    ->where('tutor_id', $tutor_id)
                    ->first();
---
SELECT *
FROM `tutors`
WHERE `tutors`.`id` = 'BoA3Ocf6wlvdCggxCK1q'
SELECT *
FROM `materi`
WHERE `id` = '10'
AND `tutor_id` = 'BoA3Ocf6wlvdCggxCK1q'
 LIMIT 1