Website_Edukasi/app/Controllers/Admin/ViewMapel.php

    public function index($id)
    {
        $tutor_id = $this->request->getCookie('tutor_id');
        if (!$tutor_id) {
            return redirect()->to('/login');
        }

        $mapelModel   = new MapelModel();
        $contentModel = new ContentModel();
        $materiModel  = new MateriModel();
        $soalModel    = new SoalModel();
        $tutorModel   = new TutorModel();

        // ambil profil tutor
        $profile = $tutorModel->find($tutor_id);

        // ambil data mapel
        $mapel = $mapelModel->where('id', $id)->where('tutor_id', $tutor_id)->first();
        if (!$mapel) {
            return redirect()->back()->with('error', 'Kerajaan tidak ditemukan!');
        }

        // ambil video
        $videos = $contentModel->where('playlist_id', $id)->where('tutor_id', $tutor_id)->findAll();

        // ambil materi
        $materi = $materiModel->where('playlist_id', $id)->where('tutor_id', $tutor_id)->findAll();

        // ambil soal
        $soal = $soalModel
            ->select('soal.*, content.title')
            ->join('content', 'content.id = soal.content_id')
            ->where('content.playlist_id', $id)
            ->where('soal.tutor_id', $tutor_id)
            ->findAll();
---
SELECT *
FROM `tutors`
WHERE `tutors`.`id` = 'BoA3Ocf6wlvdCggxCK1q'
SELECT *
FROM `mapel`
WHERE `id` = '69212ba1e5c3c'
AND `tutor_id` = 'BoA3Ocf6wlvdCggxCK1q'
 LIMIT 1
SELECT *
FROM `content`
WHERE `playlist_id` = '69212ba1e5c3c'
AND `tutor_id` = 'BoA3Ocf6wlvdCggxCK1q'
SELECT *
FROM `materi`
WHERE `playlist_id` = '69212ba1e5c3c'
AND `tutor_id` = 'BoA3Ocf6wlvdCggxCK1q'
SELECT `soal`.*, `content`.`title`
FROM `soal`
JOIN `content` ON `content`.`id` = `soal`.`content_id`
WHERE `content`.`playlist_id` = '69212ba1e5c3c'
AND `soal`.`tutor_id` = 'BoA3Ocf6wlvdCggxCK1q'